In [1]:
from pandas import  Series, DataFrame

import pandas as pd

In [3]:
obj = Series([4,7,-5,3])

In [19]:
obj2 = Series([4,7,-5,3], index=['a', 'b', 'c', 'd'])

In [28]:
obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [34]:
sdata = {'shandong':5000, 'shanghai':250, 'beijing':3000, 'bali':222}

In [35]:
obj3 = Series(sdata)
obj3

bali         222
beijing     3000
shandong    5000
shanghai     250
dtype: int64

In [36]:
province = ['shandong', 'shanghai', 'beijing', 'dongjing']

In [37]:
obj4 = Series(sdata, index=province)

In [39]:
obj4

shandong    5000.0
shanghai     250.0
beijing     3000.0
dongjing       NaN
dtype: float64

In [41]:
pd.isnull(obj4)

shandong    False
shanghai    False
beijing     False
dongjing     True
dtype: bool

In [42]:
obj4.isnull()

shandong    False
shanghai    False
beijing     False
dongjing     True
dtype: bool

In [43]:
obj3

bali         222
beijing     3000
shandong    5000
shanghai     250
dtype: int64

In [44]:
obj3+obj4

bali            NaN
beijing      6000.0
dongjing        NaN
shandong    10000.0
shanghai      500.0
dtype: float64

In [50]:
obj4.index.name = 'province'

In [51]:
obj4.name = 'renkou'

In [52]:
obj4

province
shandong    5000.0
shanghai     250.0
beijing     3000.0
dongjing       NaN
Name: renkou, dtype: float64

In [54]:
obj5=Series([[1,2,3],[4,5,6],[7,8,9]])

In [62]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [63]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [64]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [65]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [74]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [75]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [79]:
frame2.index.name='num'

In [81]:
frame2.year.name='nian'

In [88]:
frame2.ix[3]

year       2001
state    Nevada
pop         2.4
debt        NaN
Name: four, dtype: object

In [101]:
x = obj4
y = obj4.copy()

In [98]:
x.shandong=0

In [102]:
obj4

province
shandong       0.0
shanghai     250.0
beijing     3000.0
dongjing       NaN
Name: renkou, dtype: float64

In [103]:
y.shanghai=0

In [105]:
obj4

province
shandong       0.0
shanghai     250.0
beijing     3000.0
dongjing       NaN
Name: renkou, dtype: float64

In [109]:


pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [113]:
frame2

       year   state  pop debt
num
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [119]:
frame2.ix

     pop
num
two  1.7

In [126]:
df1 = DataFrame(np.arange(15.).reshape((3, 5)), columns=list('abcdf'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

      a     b     c     d     f
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0

In [124]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [127]:
df1+df2

      a     b     c     d   e   f
0   0.0   2.0   4.0   6.0 NaN NaN
1  10.0  12.0  14.0  16.0 NaN NaN
2  20.0  22.0  24.0  26.0 NaN NaN
3   NaN   NaN   NaN   NaN NaN NaN

In [128]:
df1.add(df2, fill_value=0)

      a     b     c     d     e     f
0   0.0   2.0   4.0   6.0   4.0   4.0
1  10.0  12.0  14.0  16.0   9.0   9.0
2  20.0  22.0  24.0  26.0  14.0  14.0
3  15.0  16.0  17.0  18.0  19.0   NaN

In [130]:
df2.add(df1, fill_value=2)

      a     b     c     d     e     f
0   0.0   2.0   4.0   6.0   6.0   6.0
1  10.0  12.0  14.0  16.0  11.0  11.0
2  20.0  22.0  24.0  26.0  16.0  16.0
3  17.0  18.0  19.0  20.0  21.0   NaN

In [131]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame#.iloc[0]

   0  1
2  0  1
0  2  3
1  4  5

In [145]:
frame.iat[:,1]

SyntaxError: invalid syntax (<ipython-input-145-dae8d60c9b95>, line 1)